Testing locally with Rover in `/tf/caf/examples` with:

```
terraform plan --var-file shared_image_gallery/101-packer_service_principal/image_gallery.tfvars --var-file shared_image_gallery/101-packer_service_principal/keyvaults.tfvars --var-file shared_image_gallery/101-packer_service_principal/packer.tfvars --var-file shared_image_gallery/101-packer_service_principal/role_mapping.tfvars --var-file shared_image_gallery/101-packer_service_principal/service_principal.tfvars
```

Yields:

```
  # module.example.azurerm_role_assignment.for["azuread_apps_logged_in_subscription_Contributor_packer_client"] will be created
  + resource "azurerm_role_assignment" "for" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

# module.example.module.azuread_applications["packer_client"].azuread_application.app will be created
  + resource "azuread_application" "app" {
      + app_role                   = (known after apply)
      + application_id             = (known after apply)
      + available_to_other_tenants = false
      + display_name               = "dedp-packer-client"
      + group_membership_claims    = "All"
      + homepage                   = (known after apply)
      + id                         = (known after apply)
      + identifier_uris            = (known after apply)
      + name                       = (known after apply)
      + oauth2_allow_implicit_flow = false
      + oauth2_permissions         = (known after apply)
      + object_id                  = (known after apply)
      + owners                     = [
          + "c65c38ac-be23-4321-aa58-721fc0dfba42",
        ]
      + prevent_duplicate_names    = false
      + public_client              = false
      + reply_urls                 = (known after apply)
      + type                       = "webapp/api"
   }

# module.example.module.azuread_applications["packer_client"].azuread_service_principal.app will be created
  + resource "azuread_service_principal" "app" {
      + app_role_assignment_required = true
      + app_roles                    = (known after apply)
      + application_id               = (known after apply)
      + display_name                 = (known after apply)
      + id                           = (known after apply)
      + object_id                    = (known after apply)

      + oauth2_permissions {
          + admin_consent_description  = (known after apply)
          + admin_consent_display_name = (known after apply)
          + id                         = (known after apply)
          + is_enabled                 = (known after apply)
          + type                       = (known after apply)
          + user_consent_description   = (known after apply)
          + user_consent_display_name  = (known after apply)
          + value                      = (known after apply)
        }
    }

  # module.example.module.azuread_applications["packer_client"].azuread_service_principal_password.pwd will be created
  + resource "azuread_service_principal_password" "pwd" {
      + description          = (known after apply)
      + end_date             = (known after apply)
      + id                   = (known after apply)
      + key_id               = (known after apply)
      + service_principal_id = (known after apply)
      + start_date           = (known after apply)
      + value                = (sensitive value)
    }

  # module.example.module.azuread_applications["packer_client"].azurerm_key_vault_secret.client_id["packer_client"] will be created
  + resource "azurerm_key_vault_secret" "client_id" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "packer-client-client-id"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # module.example.module.azuread_applications["packer_client"].azurerm_key_vault_secret.client_secret["packer_client"] will be created
  + resource "azurerm_key_vault_secret" "client_secret" {
      + expiration_date = (known after apply)
      + id              = (known after apply)
      + key_vault_id    = (known after apply)
      + name            = "packer-client-client-secret"
      + value           = (sensitive value)
      + version         = (known after apply)
      + versionless_id  = (known after apply)
    }

  # module.example.module.azuread_applications["packer_client"].azurerm_key_vault_secret.tenant_id["packer_client"] will be created
  + resource "azurerm_key_vault_secret" "tenant_id" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "packer-client-tenant-id"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # module.example.module.azuread_applications["packer_client"].random_password.pwd will be created
  + resource "random_password" "pwd" {
      + id          = (known after apply)
      + keepers     = (known after apply)
      + length      = 250
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.example.module.azuread_applications["packer_client"].time_rotating.pwd will be created
  + resource "time_rotating" "pwd" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_months  = 1
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.example.module.azuread_applications["packer_client"].time_sleep.wait_for_directory_propagation will be created
  + resource "time_sleep" "wait_for_directory_propagation" {
      + create_duration = "65s"
      + id              = (known after apply)
    }


  # module.example.module.image_definitions["image1"].azurecaf_name.image_name will be created
  + resource "azurecaf_name" "image_name" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "image1"
      + passthrough   = false
      + prefixes      = [
          + "dedp",
        ]
      + random_length = 0
      + resource_type = "azurerm_shared_image"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.example.module.image_definitions["image1"].azurerm_shared_image.image will be created
  + resource "azurerm_shared_image" "image" {
      + gallery_name        = (known after apply)
      + hyper_v_generation  = "V1"
      + id                  = (known after apply)
      + location            = "southeastasia"
      + name                = (known after apply)
      + os_type             = "Linux"
      + resource_group_name = (known after apply)

      + identifier {
          + offer     = "WebServer"
          + publisher = "MyCompany"
          + sku       = "2020.1"
        }
    }


  # module.example.module.keyvaults["packer_client"].azurecaf_name.keyvault will be created
  + resource "azurecaf_name" "keyvault" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "packerakv"
      + passthrough   = false
      + prefixes      = [
          + "dedp",
        ]
      + random_length = 0
      + resource_type = "azurerm_key_vault"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.example.module.keyvaults["packer_client"].azurerm_key_vault.keyvault will be created
  + resource "azurerm_key_vault" "keyvault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = false
      + enabled_for_deployment          = false
      + enabled_for_disk_encryption     = false
      + enabled_for_template_deployment = false
      + id                              = (known after apply)
      + location                        = "southeastasia"
      + name                            = (known after apply)
      + purge_protection_enabled        = false
      + resource_group_name             = (known after apply)
      + sku_name                        = "standard"
      + soft_delete_enabled             = (known after apply)
      + soft_delete_retention_days      = 7
      + tags                            = {
          + "tfstate" = "level2"
        }
      + tenant_id                       = "28cd23f5-9d83-4d2c-820e-9dd501857e1d"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + timeouts {
          + delete = "60m"
        }
    }

  # module.example.module.packer_service_principal["build1"].data.azurerm_key_vault_secret.packer_client_id will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "packer_client_id"  {
      + content_type   = (known after apply)
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "packer-client-client-id"
      + tags           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.example.module.packer_service_principal["build1"].data.azurerm_key_vault_secret.packer_secret will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "packer_secret"  {
      + content_type   = (known after apply)
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "packer-client-client-secret"
      + tags           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.example.module.packer_service_principal["build1"].data.azurerm_shared_image_version.image_version will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_shared_image_version" "image_version"  {
      + exclude_from_latest   = (known after apply)
      + gallery_name          = (known after apply)
      + id                    = (known after apply)
      + image_name            = (known after apply)
      + location              = (known after apply)
      + managed_image_id      = (known after apply)
      + name                  = "1.0.0"
      + os_disk_image_size_gb = (known after apply)
      + os_disk_snapshot_id   = (known after apply)
      + resource_group_name   = (known after apply)
      + tags                  = (known after apply)
      + target_region         = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.example.module.packer_service_principal["build1"].local_file.packer_template will be created
  + resource "local_file" "packer_template" {
      + content              = (sensitive)
      + directory_permission = "0755"
      + file_permission      = "0640"
      + filename             = "./shared_image_gallery/101-packer_service_principal/packer_files/packer_template_service_principal.json"
      + id                   = (known after apply)
    }

  # module.example.module.packer_service_principal["build1"].null_resource.create_image will be created
  + resource "null_resource" "create_image" {
      + id = (known after apply)
    }

  # module.example.module.packer_service_principal["build1"].null_resource.delete_image will be created
  + resource "null_resource" "delete_image" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.example.module.packer_service_principal["build1"].time_sleep.time_delay_3 will be created
  + resource "time_sleep" "time_delay_3" {
      + destroy_duration = "60s"
      + id               = (known after apply)
    }


  # module.example.module.resource_groups["packer"].azurecaf_name.rg will be created
  + resource "azurecaf_name" "rg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "packer"
      + passthrough   = false
      + prefixes      = [
          + "dedp",
        ]
      + random_length = 0
      + resource_type = "azurerm_resource_group"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.example.module.resource_groups["packer"].azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "southeastasia"
      + name     = (known after apply)
      + tags     = {
          + "landingzone" = "examples"
        }
    }

  # module.example.module.resource_groups["sig"].azurecaf_name.rg will be created
  + resource "azurecaf_name" "rg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "sig"
      + passthrough   = false
      + prefixes      = [
          + "dedp",
        ]
      + random_length = 0
      + resource_type = "azurerm_resource_group"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.example.module.resource_groups["sig"].azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "southeastasia"
      + name     = (known after apply)
      + tags     = {
          + "landingzone" = "examples"
        }
    }

  # module.example.module.shared_image_galleries["gallery1"].azurecaf_name.sig_name will be created
  + resource "azurecaf_name" "sig_name" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "test1"
      + passthrough   = false
      + prefixes      = [
          + "dedp",
        ]
      + random_length = 0
      + resource_type = "azurerm_shared_image_gallery"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.example.module.shared_image_galleries["gallery1"].azurerm_shared_image_gallery.gallery will be created
  + resource "azurerm_shared_image_gallery" "gallery" {
      + description         = " "
      + id                  = (known after apply)
      + location            = "southeastasia"
      + name                = (known after apply)
      + resource_group_name = (known after apply)
      + unique_name         = (known after apply)
    }

  # module.example.module.keyvaults["packer_client"].module.initial_policy[0].module.logged_in_user["logged_in_user"].azurerm_key_vault_access_policy.policy will be created
  + resource "azurerm_key_vault_access_policy" "policy" {
      + id                 = (known after apply)
      + key_vault_id       = (known after apply)
      + object_id          = "c65c38ac-be23-4321-aa58-721fc0dfba42"
      + secret_permissions = [
          + "Set",
          + "Get",
          + "List",
          + "Delete",
          + "Purge",
          + "Recover",
        ]
      + tenant_id          = "28cd23f5-9d83-4d2c-820e-9dd501857e1d"

      + timeouts {
          + delete = "60m"
        }
    }

lan: 25 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ objects = (sensitive value)

───────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly
these actions if you run "terraform apply" now.
```

Did not yet apply.